TaBTypeRacer-BackEnd/app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("paragraph", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        @challenge = Challenge.create(challenge_params)

SELECT "challenges".* FROM "challenges"
---
    def index
        @challenges = Challenge.all

SELECT "challenges".* FROM "challenges"
---
    def achall
        chosencategory = request.headers['categoryheader']
        @challenges = Challenge.all